package com.helpagri.agrimaster;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.webkit.WebView;
import android.widget.TextView;

public class BinaDhan8Activity extends AppCompatActivity {

    private WebView webView;
    private TextView textView;

    String myText="<html><body><center><h2>জাতের বিবরণ</h2></center>" +
            "<big>" +
            "ফসলের নাম    :<b> বোরো</b><br/>" +
            "জাতের নাম     :<b> বিনা ধান-৮ (বোরো মৌসুম)</b><br/><br/>" +
            "<b>বৈশিষ্ট্য :</b> পূর্ন বয়স্ক গাছেরউচ্চতা ৯০-৯৫ সেঃমিঃ এবং হেলে পড়ে না। জীনবকাল ১৩০-১৩৫ দিন। উচ্চ ফলনশীল ও আলোক অসংবেদনশীল বোরো ধানের জাত। কুশি অবস্থা থেকে পরিপক্কতা পর্যন্ত ৮-১০ ডিএস/মিটার এবং চারা অবস্থায় ১২-১৪ ডিএস/মিটার মাত্রার লবণাক্ততা সহনশীল। ডিগপাতা খাড়া এবং লম্বা। পরিপক্ক অবস্থা পর্যন্ত পাতা এবং কান্ড সবুজ থাকে। ধান উজ্জ্বল, শক্ত এবং চাল মাঝারি মোটা। ১০০০ ধানের ওজন ২৬.৭গ্রাঃ । বিনাধান-১০ স্বাভাবিক অবস্থায় বীজতলায় বীজ ফেলা থেকে ফসল পাকা অবধি ১৩০-১৩৫ দিন পরে কাটা যায়।<br/>" +
            "<b>উপযোগী এলাকা :</b> দেশের লবণাক্ত ও অলবণাক্ত উভয় এলাকায় এ জাতটি চাষের উপযোগী। তবে অলবণাক্ত এলাকায় ফলন কিছুটা বেশি পাওয়া যায়।<br/>" +
            "<b>বপনের সময় :</b> এ জাতের বীজ নভেম্বর মাসের ১ম সপ্তাহ হতে শুরু করে ২য় সপ্তাহ পর্যন্ত বীজতলায় ফেলার উপযুক্ত সময়।<br/>" +
            "<center><img src=\"file:///android_res/drawable/binadhan8.gif\" width=\"150\" height=\"100\" /></center><br/>" +
            "<center><h3> রোগবালাই ও দমন ব্যবস্থা</h3></center>" +
            "<b>রোগবালাই:</b> খোলা ঝলসানো, ব্যাক্টেরিয়াল লিফব্লাইট বা পাতা ঝলসানো, কান্ড পচাঁ রোগ<br/>" +
            "<b>দমন ব্যবস্থা:</b> রোগ বালাই আক্রমণ দেখা দিলে নিকটস্থ কৃষি সম্প্রসারণ কর্মকর্তার উপদেশ মোতাবেক প্রয়োজনীয় ব্যবস্থা নিতে হবে। এ ছাড়া খোলা ঝলসানো, ব্যাক্টেরিয়াল লিফব্লাইট বা পাতা ঝলসানো ও অন্যান্য রোগ দেখা দিলে উপযুক্ত ছত্রাকনাশক প্রয়োগ করতে হবে। খোল ঝলসানো, কান্ড পচাঁ রোগ দেখা দিলে বেনলেট, হোমাই, বেভিষ্টিন বা টপসিন মিথাইল মাত্রা অনুযায়ী প্রয়োগ করা যেতে পারে।<br/>" +
            "<center><h3> পোকামাকড় ও দমন ব্যবস্থা</h3></center>" +
            "<b>পোকামাকড়:</b><br/>" +
            "<b>দমন ব্যবস্থা :</b> কীট পতঙ্গের আক্রমণ দেখা দিলে নিকটস্থ কৃষি সম্প্রসারণ কর্মকর্তার উপদেশ মোতাবেক প্রয়োজনীয় ব্যবস্থা নিতে হবে। পোকামাকড়ের আক্রমণ দেখা নিলে প্রচলিত তরল বা আনাদার কীটনাশক ব্যবহার করা যেতে পারে।<br/>" +
            "<center><h3>সার ব্যবস্থাপনা</h3></center>" +
            " <table border = \"1\">" +
            "         <tr>" +
            "            <td>সারের নাম</td>" +
            "            <td>প্রতি হেক্টরে</td>" +
            "            <td>প্রতি একরে</td>" +
            "            <td>প্রতি শতাংশে</td>" +
            "            <td>প্রতি হেক্টরে</td>" +
            "            <td>প্রতি একরে</td>" +
            "            <td>প্রতি শতাংশে</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>ইউরিয়া (কেজি)</td>" +
            "            <td>১০০-১২০</td>" +
            "            <td>৪০-৫০</td>" +
            "            <td>০.৪-০.৫</td>" +
            "            <td>২১০-২৩০</td>" +
            "            <td>৮৫-৯৩</td>" +
            "            <td>০.৮৫-০.৯৩</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>টিএসপি (কেজি)</td>" +
            "            <td>৮০-১০০</td>" +
            "            <td>৩২-৪০</td>" +
            "            <td>০.৩-০.৪</td>" +
            "            <td>১১০-১২০</td>" +
            "            <td>৪৫-৫০</td>" +
            "            <td>০.৪৫-০.৫০</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>এমপি (কেজি)</td>" +
            "            <td>৩০-৫০</td>" +
            "            <td>১২-২০</td>" +
            "            <td>০.১-০.২</td>" +
            "            <td>৬০-৮০</td>" +
            "            <td>২৪-৩২</td>" +
            "            <td>০.২৪-০.৩২</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>জিপসাম (কেজি)</td>" +
            "            <td>-</td>" +
            "            <td>-</td>" +
            "            <td>-</td>" +
            "            <td>৪৫-৫০</td>" +
            "            <td>১৮-২০</td>" +
            "            <td>০.১৮-০.২০</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>দস্তা (কেজি)</td>" +
            "            <td>-</td>" +
            "            <td>-</td>" +
            "            <td>-</td>" +
            "            <td>৪.০-৪.৫</td>" +
            "            <td>১.৫-২.০</td>" +
            "            <td>০.০১৬-০.০২</td>" +
            "         </tr>" +
            "      </table>" +
            "<br/>" +
            "রোপন জন্য জমি তৈরীর শেষ চাষের আগে সম্পূর্ণ টিএসপি, এমপি, জিপসাম এবং দস্তা জমিতে সমভাবে ছিটিয়ে চাষের মাধ্যমে মাটির সাথে ভালভাবে মিশিয়ে দিতে হবে। ইউরিয়া সারের অর্ধেক পরিমাণ চারা রোপণের ৭-৮ দিন পর এবং বাঁকী অর্ধেক ৩০-৩৫ দিন পর উপরি প্রয়োগ করতে হবে অথবা এক তৃতীয়াংশ চারা রোপনের ৭-৮ দিন পর, এক তৃতীয়াংশ চারা রোপনের ১৮-২০ দিন পর এবং শেষ তৃতীয়াংশ চারা রোপনের ৩০-৩৫ দিন পর জমির উর্বরতার উপর নির্ভর করে প্রয়োগ করতে হবে। অনুর্বর জমিতে হেক্টর প্রতি জিপসাম ৫০ কেজি (একর প্রতি ২০ কেজি) এবং দস্তা সার ৪ কেজি (একর প্রতি ১.৬ কেজি) হারে দেয়া যেতে পারে। ইউরিয়া সার প্রয়োগের ২/১ দিন আগে জমির অতিরিক্ত পানি বের করে দিতে হবে এবং প্রয়োজন হলে আগাছা দমন করতে হবে। জমির উর্বরতা ও ফসলের অবস্থায় উপর নির্ভর করে ইউরিয়া সার প্রয়োগ মাত্রার তারতম্য করা যেতে পারে।" +
            "</big></body></html>";
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_bina_dhan8);

        webView = (WebView) findViewById(R.id.webViewId);
        textView = (TextView) findViewById(R.id.textViewId);

        webView.loadDataWithBaseURL(null,myText,"text/html","utf-8",null);
        textView.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(BinaDhan8Activity.this,Button5Activity.class);
                startActivity(intent);
            }
        });
    }
}
