package com.helpagri.agrimaster;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.webkit.WebView;
import android.widget.TextView;

public class Bri65Activity extends AppCompatActivity {

    private TextView textView;
    private WebView webView;
    String myText = "<html><body><center><h1> জাতের বিবরণ</h1></center>" +
            "<big>ফসলের নাম    : <b>আউশ ধান</b><br/>" +
            "জাতের নাম     : <b>ব্রি ধান ৬৫</b><br/><br/>" +
            "<b>বৈশিষ্ট্য :</b><br/>" +
            "<b>জাত পরিচিত :</b>" +
            "ব্রি ধান৬৫ এর কৌলিক সারি নং OM1490G। উক্ত কৌলিক সারিটি OM606 এবং IR44592-62-1-1-3 এর সংকরায়নের মাধ্যমে Vietnam এ প্রজনন পদ্ধতিতে বংশানুক্রমিক কোলিক বাছাই (Pedigree selection) প্রক্রিয়ায় উদ্ভাবন করা হয়েছে। উক্ত কৌলিক সারিটি বাংলাদেশ ধান গবেষণা ইনস্টিটিউট এ Vietnam হতে NIGER- material হিসেবে IRRI থেকে প্রাপ্ত হয়ে প্রজনন প্রক্রিয়ায় পরীক্ষা নিরীক্ষা ও দেশের বিভিন্ন অঞ্চলে কৃষকের মাঠে ফলন পরীক্ষায় সন্তোষজনক হওয়ায় বোনা আউশ মোসুমে ব্রি ধান৪২ ও ব্রি ধান৪৩ জাতের চাষাবাদ উপযোগী খরাপ্রবণ এলাকায় সরাসরি মাঠে বপনের জাত হিসেবে চুড়ান্তভাবে নির্বাচন করা হয়।<br/>" +
            "<b>জাতের বৈশিষ্ট্য </b><br/>" +
            "১। ব্রি ধান ৬৫ বোনা আউশ মৌসুমের খরা সহনশীল জাত।<br/>" +
            "২। গাছের উচ্চতা ৯০-৯৫ সেন্টিমিটার। <br/>" +
            "৩। উচ্চ ফলনশীল। <br/>" +
            "৪। চাল মাঝারি চিকন ও সাদা এবং ভাত ঝরঝরে।<br/>" +
            "<b>জীবনকাল :</b>" +
            "জাতটির জীবনকাল ৮৮-১০০ দিন। <br/>" +
            "<b>ফলন :</b>" +
            "উপযুক্ত পরিচর্যা হেক্টর প্রতি ৩.৫-৪.০ টন ফলন দিয়ে থাকে। <br/>" +
            "<b>উপযোগী এলাকা :</b>খরাপ্রবণ এলাকায়<br/>" +
            "<b>বপনের সময় : </b>১৫ চৈত্র থেকে ১৫ বৈশাখ (এপ্রিলের প্রথম -শেষ সপ্তাহ)<br/>" +
            "<b>মাড়াইয়ের সময় : </b>১৫ আষাঢ় থেকে ১৫ শ্রাবণ (জুলাইয়ের প্রথম - শেষ সপ্তাহ)<br/>" +
            "<center><h3> রোগবালাই ও দমন ব্যবস্থা</h3></center>" +
            "<b>রোগবালাই :</b><br/>" +
            "<b>১। উফরা রোগ</b><br/>" +
            "<b>রোগ পরিচিতি :</b><br/>" +
            "প্রতি বছর প্রায় দুই লাখ হেক্টর জমির ধান উফরা রোগে আক্রান্ত হয়। সাধারণত শতকরা ৪০-১০০ ভাগ ফলন নষ্ট হয়ে যেতে পারে। বিভিন্ন এলাকায় ও রোগ ডাকপোড়া, জ্বলে যাওয়া, পুড়ে যাওয়া, লোনা লাগা ইত্যাদি নামে পরিচিত। বৃহত্তর বরিশাল, পটুয়াখালি, ফরিদপুর, কুমিল্লা, সিলেট, খুলনা ও ঢাকা জেলার ও রোগ দেখা যায়। রোপ আমন, বোরো এমনকি আউশ ধানেও ও রোগ দেখা যায়।<br/>" +
            "<b>রোগের কারণ ওলক্ষণ :</b>" +
            "এক ধারনের কৃমি দ্বারা এ রোগ হয়। কৃমি ধান গাছের আগার কচি অংশের রস শুষে খায়, ফলে পাতা ও খোলের সংযোগস্থলে সাদা ছিটা-ফোটা দাগ দেখা দেয়। আক্রমণ বেশি হলে ডিগ পাতা পুরোটাই সাদা হয়ে যেতে পারে। সাদা দাগ ক্রমে বাদামি রঙে পরিণত হয় এবং পরে এ দাগ বেড়ে সম্পূর্ণ পাতাটাই শুকিয়ে ফেলে। ফলে অনেক সময় থোড় হতে ছড়া বের হতে পারে না বা বের হলেও অর্ধেক বা আংশিক বের হয়। তবে ধান খুব চিটা ও অপুষ্ট হয়। ছড়া বের হতে না পারলে তা ভিতরে মোচড়ানো অবস্থায় থাকে। আক্রান্ত গাছ সুস্থ গাছের তুলনায় কিছুটা বেঁটে হয়। আক্রমণ বেশি হলে জমিতে তেমন কোন ফলন হয়না।<br/>" +
            "<b>আক্রমণের অনুকূল অবস্থা ও বিস্তার পদ্ধতি :</b><br/>" +
            "শুকনো আবহাওয়া ও কম তাপমাত্রার জন্য বোরো ধানে এ রোগের প্রকোপ কিছুটা কম হয়। বাতাসের তাপমাত্রা ২৮-৩০ ডিগ্রী সেন্টিগ্রেড, বায়ুর আর্দ্রতা শতকরা ৭০ ভাগের বেশি, ঘন ঘন বৃষ্টি ও জমিতে পানি জমে থাকা এ রোগের জন্য বিশেষ উপযোগী। এই কৃমি ফসল কাটার পর আক্রান্ত গাছে কুন্ডলী পাকিয়ে অথবা স্বাভাবিক অবস্থায় বেঁচে থাকতে পারে। আক্রান্ত জমির পরিত্যক্ত নাড়া, খড়কুটা শিষে বা ঝড়ে যাওয়া ধানে এবং মাটিতে কোন খাদ্য ছাড়াই এই কৃমি কুন্ডলী পাকিয়ে ৬-৮ মাস বেঁচে থাকতে পারে। প্রাথমিক উৎস থেকে বৃষ্টি, সেচ অথবা বন্যার পানিতে কৃমি বের হয়ে আসে এবং ধান গাছে আক্রমণ করে।<br/>" +
            "<b>২। টুংরো রোগ</b><br/>" +
            "<b>রোগ পরিচিতি :</b><br/>" +
            "টুংরো ভাইরাসজনিত একটি মারাত্নক ক্ষতিকারক রোগ। এ রোগের আক্রমণের ধান ফসলের ব্যাপক ক্ষতি হয়। প্রতি ২-৩ বছর পর পর এ রোগের ব্যাপক আক্রমণ দেখা যায়। আক্রান্ত এলাকাসমূহের মধ্যে চট্রগ্রাম, ঢাকা, ময়মনসিংহ, কুমিল্লা এবং বৃহত্তর বরিশাল উল্লেখযোগ্য।<br/>" +
            "<b>রোগের কারণ :</b><br/>" +
            "রাইস টুংরো ভাইরাস নামক এক ধরণের অতি সুক্ষ ভাইরাস দ্বারা এ রোগ হয়ে থাকে। সবুজ পাতা ফড়িং উক্ত ভাইরাস ছড়ায়।<br/>" +
            "<b>রোগটি চেনার উপায়:</b><br/>" +
            "১। গাছ হলদে অথবা কমলা বর্ণের হয়।<br/>" +
            "২। গাছ খাটো হয়ে বসে যায়।<br/>" +
            "৩। গাছের কচি পাতা হলদে, চওড়া, খাটো বা মোচড়ানো হয়।<br/>" +
            "৪। আক্রান্ত পাতাগুলো ভুমির দিকে নুয়ে পড়ে।<br/>" +
            "৫। একাধিক পাতার গোড়া বা খোল একত্রে পুরনো পাতার খোলের মধ্যে আটকে থাকে।<br/>" +
            "৬। কুশিরা সংখ্যা কম হয়।<br/>" +
            "৩। ধানের ফোস্কা দাগ রোগ<br/>" +
            "<b>রোগ পরিচিতি :</b><br/>" +
            "পাতার ফোস্কা দাগ ধানের একটি ছত্রাকজনিত রোগ। এটি মাইক্রোডকিয়াম অরাইজি নামক এক ধরনের ছত্রাকের আক্রমণে হয়। বাংলাদেশের ধানের প্রধান রোগগুলির এটি একটি। রোগটি আমন ও বোরো মৌসুমে বেশি হয় এবং চারা অবস্থা থেকে ধানের ফুল আসা পর্যন্ত যে কোন সময় দেখা যায়। তবে ধানের থোড় অবস্থায় রোগটি বেশি দেখা যায়। রোগকাতর জাতে রোগটি হলে ধানের ফলন শতকরা ৩০ ভাগ পর্যন্ত কমে যায়।<br/>" +
            "<b>রোগটি চিনার উপায় :</b>" +
            "রোগ দমনের সঠিক কার্যক্রম নেয়ার জন্য রোগটি সঠিকভাবে চেনা প্রয়োজন। রোগ সম্পর্কে সঠিক ধারনা না থাকলে রোগের ভুল চিকিৎসা করার আশংকাই বেশি থাকে এবং এতে অর্থ, সময় এ শ্রমের অপচয় ছাড়া কোন লাভ হয় না। তাই আপনার জমিতে কী রোগ হল তা জানা খুবই প্রয়োজন। আর রোগ চিনতে হলে রোগের লক্ষণ সম্পর্কে সম্যক ধারণা থাকা প্রয়োজন।<br/>" +
            "<b>রোগের লক্ষণ :</b>" +
            "রোগটি ধান গাছে বিভিন্ন ধরণের লক্ষণ সৃষ্টি করে থাকে। তবে সচরাচর পাতায় যে লক্ষণটি বেশি দেখা যায় তা হল পাতার আগা থেকে দাগ আরম্ভ হয়ে নিচের দিকে বাড়তে থাকে। প্রথমত পাতায় ভেজা জলপাই রঙের দাগ হয় যা আস্তে আস্তে গাঢ় বাদামি ও হালকা বাদামি দাগে পরিণত হয় এবং পাশাপাশি সন্নিবেশিত হয়ে ঢেউ এর মত দাগের সমাহার ঘটায়। তবে অনেক সময় গাঢ় বাদামি আড়াআড়ি রেখা না হয়ে শুধুই বাদমি রঙ হয়ে দাগ বাড়তে থাকে এবং আক্রান্ত অংশ ধীরে ধীরে শুকনা খড়ের রঙ ধারন করে। অনেক সময় পাতার কিনারা থেকে দাগ সৃষ্টি হয়, যা পাতায় আড়াআড়ি বাড়তে থাকে এবং আক্রান্ত অংশের উপরের ও নিচের অংশ সবুজ থাকে।<br/>" +
            "<b>রোগের অনুকুল অবস্থা:</b><br/>" +
            "১। আর্দ্র ও ঠান্ডা আবহাওয়া (২০ ডিগ্রী সে:)<br/>" +
            "২। বেশি পরিমাণে নাইট্রোজেন সার ব্যবহারের ফলে<br/>" +
            "৩। আক্রান্ত বীজ ব্যবহার করলে <br/>" +
            "৪। জমিতে বা আশে পাশে পোষক আগাছা থাকলে <br/>" +
            "৪। বাদামী দাগ রোগ <br/>" +
            "<b>রোগ পরিচিতি :</b><br/>" +
            "বাদামী দাগ ধানের একটি ছত্রাকজনিত রোগ। রোগটি সব মৌমুমেই দেখা যায়। রোগটি ধানের বিভিন্ন অংশ আক্রমণ করতে পারে। তবে সচরাচর পাতা এ বীজে এর আক্রশণ বেশি দেখা যায়। মাটিতে খাদ্য উপাদান বা পানির অভাব হলে রোগটির মাত্রা বেড়ে যায়।<br/>" +
            "<b>রোগটি চিনার উপায় :</b><br/>" +
            "১। পাতায় প্রথমে ছোট ছোট বাদামি রঙের দাগ দেখা যায়।<br/>" +
            "২। দাগগুলি আস্তে আস্তে বড় হয়ে অনেকটা তিলের বীজের মত আকার ধারণ করে।<br/>" +
            "৩। ধানের জাতভেদে দাগের আকার ও বর্ণ বিভিন্ন হতে পারে।<br/>" +
            "৪। রোগকাতর জাতে দাগের আকার বড় হয় এবং দাগের মাঝখানটা ধূসর বর্ণ বা হালকা বাদামী রঙের হয়: পাতায় অনেক দাগের সৃষ্টি হয় ফলে পাতাটি মারা যায়<br/>" +
            "৫। অনেক সময় দাগের চারিদিকে হলুদ রঙ ধারণ করতে দেখা যায়।<br/>" +
            "<b>রোগের অনুকুল অবস্থা:</b><br/>" +
            "১। হালকা মাটি যার পানি ধারণ ক্ষমতা কম<br/>" +
            "২। মাটিতে জৈব পদার্থের ঘাটতি <br/>" +
            "৩। রোগ আক্রান্ত বীজ ব্যবহার করলে<br/>" +
            "৪। নাইট্রোজেন, পটাশ, দস্তা সার ও পানির অভাব <br/>" +
            "৫। খোলপচা রোগ<br/>" +
            "<b>রোগ পরিচিতি :</b>" +
            "খোলপচা ধানের ছত্রাকজনিত একটি রোগ। বাংলাদেশে ধানের প্রধান রোগগুলোর মধ্যে খোলপচা অন্যতম ক্ষতিকারক রোগ। এ রোগ বাংলাদেশ ছাড়াও বিভিন্ন ধান উৎপাদনকারী দেশে দেখা যায়। রোগটি সাধারণত ধানের থোড় অবস্থা থেকে শুরু হয়। বাংলাদেশের প্রায় সকল অঞ্চলেই রোগটি দেখা যায় এবং এ রোগ ধানের ফলন ও গুণগতমান কমিয়ে দেয়।<br/>" +
            "<b>রোগটি চিনার উপায় :</b>" +
            "রোগটি ডিগপাতায় খোলের উপরের অংশে শুরু হয়। শুরুতে ছোট ও গোলাকার বা অনিয়মিত আকারের বাদামি দাগ হয়। আস্তে আস্তে দাগ বড় হতে থাকে এবং কালচে হতে ধূসর রঙের হয। রোগের মাত্রা বেশি হলে শিষ বের হতে পারে না অথবা রোগের তীব্রতা অনুযায়ী আংশিক বের হয় তবে ধান বেশির ভাগ কালো ও চিটা হয়ে যায়। আক্রান্ত শিষ খোল থেকে খুলে দেখলে সাদা সাদা ছত্রাক কান্ড দেখা যায়। অনেক সময় নিচের দিকের খোল ও আক্রান্ত হয় কিন্তু ওই অবস্থায ফসলের কোন ক্ষতি হয় না।<br/>" +
            "<b>রোগের অনুকুল অবস্থা:</b><br/>" +
            "১। জমিতে পড়ে থাকা আক্রান্ত খড়কুটা<br/>" +
            "২। বেশি পরিমাণে নাইট্রোজেন সার ব্যবহারের ফলে<br/>" +
            "৩। আক্রান্ত বীজ ব্যবহার করলে<br/>" +
            "৪। পোকা বা অন্য কোন কারণে খোলে ক্ষত থাকা<br/>" +
            "৫। অধিক তাপমাত্রা (৩০-৩১ ডিগ্রী সেন্টিগ্রেড) ও আর্দ্রতা <br/>" +
            "<b>দমন ব্যবস্থা:</b><br/>" +
            "<b>উফরা রোগ :</b><br/>" +
            "১।। উফরা রোগ প্রতিরোধ করতে পারে এমন কোন উফশী ধান এখনও পাওয়া যায়নি। তবে রায়দা এবং বাজাইল জাতীয় স্থানীয় জলি আমন ধানে প্রতিরোধ ক্ষমতা আছে।<br/>" +
            "২। রোগাক্রান্ত জমির ফসল কাটার পর নাড়া ও খড় জমিতে পুড়ে ফেলা <br/>" +
            "৩। ঘাস জাতীয় আগাছা, আক্রান্ত ধানের গোড়া থেকে গজানো কুশি বা মুড়ি ধান গাছ ধ্বংস করা।<br/>" +
            "৪। রোগাক্রান্ত জমির খড় গরুকে খাওয়ানোর জন্য বাড়িতে স্তুপ দিয়ে না রেখে বরং পুড়ে ফেলা ভাল, কারণ এ খড় কৃমি বহন করে ও পরে বৃষ্টির পানির সাথে জমিতে গড়িয়ে আসে।<br/>" +
            "৫। সেখানে সম্ভব সেখানে বছরের প্রথম বৃষ্টির পর জমি চাষ দিয়ে ১৫-২০ দিন শুকানো।<br/>" +
            "৬। ধান ছাড়াও জমিতে অন্যান্য ফসলের চাষ করা। <br/>" +
            "৭। বীজতলা থেকে উফরা আক্রান্ত চারা বেছে জমিতে সুস্থ চারা লাগানো। <br/>" +
            "৮। ফুরাডান ৫ জি নামক দানাদার কৃমিনাশক বিঘা প্রতি ৩ কেজি হিসেবে ফসলের প্রথম অবস্থায় ক্ষেতে ছিটিয়ে মিশিয়ে দেয়া।<br/>" +
            "৯। উফরা আক্রান্ত এলাকায় প্রতি কাঠা বীজতলাতে ১৫০ গ্রাম দানাদার কৃমিনাশক ছিটিয়ে দিয়ে ধানের বীজ বুনলে চারাতে এ রোগ হওয়ার আশংকা কম থাকে।<br/>" +
            "১০। চারা লাগানোর ১২-২০ ঘন্টা আগে বীজতলা থেকে উঠিয়ে তার শিকড় কৃমিনাশকের ১.৫% দ্রবণে (এক লিটার পানিতে ১.৫ গ্রাম কৃমিনাশক) ভিজিয়ে রেখে পরে তা জমিতে লাগানো।<br/>" +
            "<b>টুংরো রোগ:</b><br/>" +
            "১। টুংরো আক্রান্ত জমির আশেপাশে বীজতলা তৈরি না করা, সর্বদা বীজতলায় বাহক পোকা দমনের ব্যবস্থা নেয়া;<br/>" +
            "২। বীজতলা তৈরি করার সময় আশপাশের জমিতে পরিত্যক্ত টুংরো আক্রান্ত ধানগাছ, বাওয়া ধান, মুড়িধান ও আড়ালী ঘাস থাকলে তা তুলে ধ্বংস করা; <br/>" +
            "৩। চারা রোপণের পর থেকে কুশি বৃদ্ধির শেষ পর্যন্ত ক্ষেতে বাহক পোকা দেখা মাত্র তা সকল চাষি মিলে দমন করা, হাতজালের প্রতি টানে একটি করে বাহক পোকা দেখা দিলে কীটনাশক প্রয়োগ করা;<br/>" +
            "৪। প্রাথমিক অবস্থায় টুংরো আক্রান্ত গাছ দেখা মাত্র তা মাটিতে পুঁতে ফেলা। <br/>" +
            "<b>ফোস্কা দাগ রোগ:</b><br/>" +
            "১। আক্রান্ত খড়কুটা জমিতে পুড়িয়ে ফেলা <br/>" +
            "২। রোগমুক্ত জমি থেকে বীজ সংগ্রহ করা <br/>" +
            "৩। ছত্রাকনাশকের ব্যবহার: বিঘাপ্রতি ৩০০ গ্রাম থিওভিট, সালফোলাক, মাইক্রোথিওল বা কুমুলাস থোড় অবস্থায় প্রয়োগ করা <br/>" +
            "<b>বাদামী দাগ রোগ </b><br/>" +
            "১। সুষম সারের ব্যবহার <br/>" +
            "২। অধিক পরিমাণে জৈব সারের ব্যবহার <br/>" +
            "৩। সঠিক পানি ব্যবস্থাপনা <br/>" +
            "৪। সুস্থ বীজের ব্যবহার <br/>" +
            "৫। বীজ শোধন করা (ব্যাভিস্টিন/নেটিভো ৩ গ্রাম/কেজি বীজ) <br/>" +
            "৬। সঠিক মাত্রায় সার প্রয়োগ করা <br/>" +
            "<b>খোলপচা রোগ </b><br/>" +
            "১। আক্রান্ত খড়কুটা জমিতে পুড়িয়ে ফেলা <br/>" +
            "২। পরিমিত সারের ব্যবহার <br/>" +
            "৩। বিঘা প্রতি ১৩৩ সিসি টিল্ট প্রয়োগ করা <br/>" +
            "৪। সুস্থ বীজের ব্যবহার <br/>" +
            "৫। বীজ শোধন করা (ব্যাভিস্টিন/নেটিভো ৩ গ্রাম/কেজি বীজ)<br/>" +
            "<center><h3>পোকামাকড় ও দমন ব্যবস্থা</h3></center>" +
            "<b>পোকামাকড়:</b><br/>" +
            "<b>১। গলমাছি বা নলিমাছি :</b><br/>" +
            "<b>পোকা পরিচিতি :</b>" +
            "গলমাছি প্রধাণত রোপা আমন ফসলের ক্ষতি করে থাকে। তবে, আবহাওয়া অনুকূল হলে আউশ ফসলেও আক্রমণ করতে পারে।" +
            "পূর্ণবয়স্ক গলমাছি দেখতে একটা মশার মত, পেট উজ্জ্বল লাল রঙের। স্ত্রী গল মাছি পাতার নিচে বা খোলপাতার উপর একটি একটি করে ডিম পাড়ে। ডিম থেকে কীড়া ফুটতে ৩-৪ দিন লাগে। সদ্য ফোটা কীড়াগুলো মাঝখানের পাতার গোড়ায় খেতে থাকে। ফলে, মাঝখানে পাতাটি নলাকার বা গল হয়ে যায়। এই গলের ভিতরে কীড়া পুত্তলিতে পরিণত হয় এবং পুত্তলি থেকে পূর্ণ বয়স্ক গল মাছি বের হয়ে আসে। গল মাছির জীবন চক্র আড়াই থেকে তিন সপ্তাহ পর্যন্ত হতে পারে।<br/>" +
            "<b>ক্ষতি:</b><br/>" +
            "১। এ পোকার কীড়া ধান গাছের মাঝখানের পাতার ক্ষতি করে।<br/>" +
            "২। শুধুমাত্র আমন মৌসুমে এই পোকার প্রাদুর্ভাব দেখা যায়।<br/>" +
            "৩। ধান গাছ কুশি অবস্থায় আক্রান্ত হয়। কাইচথোড় অবস্থায় গলমাছি গল সৃষ্টি করতে পারে না।<br/>" +
            "৪। এ পোকার ক্ষতির নমুনাকে বাংলায় পেয়াজপাতা এবং ইংরেজীতে সিলভার শুট বলা হয়।<br/>" +
            "<b>২। থ্রিপস :</b><br/>" +
            "<b>পোকা পরিচিতি :</b>" +
            "পূর্ণবয়স্ক থ্রিপস খুবই ছোট (১-২ মিলিমিটার লম্বা) গাঢ় বাদামি রঙের। এরা পাকাবিশিষ্ট বা পাখাবিহীন হতে পারে।<br/>" +
            "স্ত্রী পোকা পাতার মধ্যে ডিম ঢুকিয়ে দেয়। ডিমগুলো খুবই ছোট (১/৪ মিলিমিটার লম্বা)। প্রথম অবস্থায় ডিমগুলো স্বচ্ছ থাকে এবং ফোটার আগে আস্তে আস্তে হলদে রঙ ধারণ করে। সদ্য ফোটা বাচ্চাগুলো কিছুক্ষণ নিশ্চল থাকে। পরে মাঝখানের কচি পাতা ও পাতার খোলে গিয়ে খাওয়া শুরু করে এবং পূর্ণবয়স্ক পোকায় পরিণত হওয়ার পরও তাদের জীবনকাল এখানেই কাটায়।<br/>" +
            "<b>ক্ষতি:</b><br/>" +
            "১। এ পোকা বাচ্চা ও পূর্ণবয়স্ক অবস্থায় ধানের পাতার রস শুষে খায়।<br/>" +
            "২। সব মৌসুমে এই পোকার প্রাদুর্ভাব দেখা যায় তবে আউশ মৌসুমে প্রকোপ বেশি থাকে<br/>" +
            "৩। ধান গাছ কুশি অবস্থায় আক্রান্ত হয়। <br/>" +
            "৪। আক্রান্ত গাছের পাতাগুলো লম্বালম্বিভাবে মুড়িয়ে সুচের আকার ধারণ করে <br/>" +
            "৫। খুব বেশি আক্রান্ত পাতা শুকিয়ে মারা যায়।<br/>" +
            "৪। এ পোকার ক্ষতির নমুনাকে বাংলায় পেয়াজপাতা এবং ইংরেজীতে সিলভার শুট বলা হয়।<br/>" +
            "<b>৩। পামরি পোকা :</b><br/>" +
            "<b>পোকা পরিচিতি :</b>" +
            "পূর্ণবয়স্ক পামরি পোকার গায়ের রঙ চকচকে কালো এবং পিঠের উপর অসংখ্য কাঁটা আছে। সারা দেহ ছোট ছোট কাঁটায় আবৃত।" +
            "স্ত্রী পোকা পাতার পিঠে একটি করে ডিম পাড়ে। এক থেকে তিন দিনে ডিম থেকে কীড়া বের হয়। কীড়াগুলো পাতার দুই পর্দার ভিতর সুরঙ্গ করে খায় এবং এখানেই ৯-১৩ দিনের মধ্যে পুত্তলীতে পরিণত হয়। তিন-চার দিন পর পুত্তলী পূর্ণবয়স্ক পোকায় পরিণত হয়।<br/>" +
            "<b>ক্ষতি:</b><br/>" +
            "১। পূর্ণবয়স্ক পোকা এবং কীড়া উভয়ই ধান গাছে আক্রমণ করে।<br/>" +
            "২। পূর্ণবয়স্ক পোকা ধানের পাতার উপর সমান্তরাল দাগ করে সবুজ অংশ খেয়ে ফেলে।<br/>" +
            "৩। কীড়া পাতার দুটি স্তরের ভিতরে সুরঙ্গ করে খায়।<br/>" +
            "৪। পূর্ণবয়স্ক পোকা অনেক দূর পর্যন্ত উড়তে পারে; ফলে একে এলাকা থেকে অন্য এলাকায় গিয়ে ধানের ক্ষতি করতে পারে।<br/>" +
            "৫। আমন ধান কাটার পর মুড়ি ফসল বা জলাশয়ে উদ্ভিদে পামরি পোকা আশ্রয় নেয় এবং বোরো ফসলে পোকার প্রাথমিক আক্রমণ শুরু হয়।<br/>" +
            "৪। এ পোকার ক্ষতির নমুনাকে বাংলায় পেয়াজপাতা এবং ইংরেজীতে সিলভার শুট বলা হয়।<br/>" +
            "<b>৪। ঘাসফড়িং :</b><br/>" +
            "<b>পোকা পরিচিতি :</b>" +
            "পূর্ণবয়স্ক ঘাসফড়িং ৩-৪ সেন্টিমিটার লম্ব। পিছনের দুটো পা লম্বা হওয়ায় এরা লাফিয়ে লাফিয়ে চলে। এদের গায়ের রঙ হালকা সবুজ অথবা হলদে বাদামি। স্ত্রী ফড়িং মাটির মধ্যে ডিম পাড়ে। ডিম থেকে কীড়া ফুটতে ১৫-১৮ দিন লাগে। আবহাওয়া ভেদে কীড়া আড়াই থেকে তিন মাস এবং পূর্ণবয়স্ক ফড়িং দেড় থেকে দুইমাস বেঁচে থাকে। এদের জীবন চক্র শেষ হতে প্রায় তিন মাস সময় লাগে।<br/>" +
            "<b>ক্ষতি:</b><br/>" +
            "১। বাচ্চা এবং পূর্ণবয়স্ক ফড়িং উভয়েই ধান গাছের ক্ষতি করে।<br/>" +
            "২। এরা গাছের পাতা কিনারা থেকে কেটে কেটে খায়। আক্রমণ বেশি হলে এরা পাতার মধ্য শিরা বাদে সম্পূর্ণ পাতা খেয়ে ফেলতে পারে।<br/>" +
            "৩। এ ধরণের ক্ষতি ফলে গাছ দুর্বল হয়ে পড়ে এবং ফলন কমে যায়।<br/>" +
            "৪। আউশ মৌসুমে এ পোকার প্রাদুর্ভাব বেশি হলেও বোরো ও রোপা আমন ফসলেও এর আক্রমণ দেখতে পাওয়া যায়।<br/>" +
            "<b>৫। পাতামোড়ানো পোকা :</b><br/>" +
            "<b>পোকা পরিচিতি :</b>" +
            "পূর্ণবয়স্ক পাতমোড়ানো পোকা এক ধরণের মথ। গায়ের রঙ বাদমি এবং পাখায় আড়াআড়ি ভাবে ২-৩টি দাগ থাকে।" +
            "এ পোকার জীবনচক্রে চারটি স্তর থাকে (ডিম, কীড়া, পুত্তলি, এবং বয়স্ক মথ)। পূর্ণবয়স্ক স্ত্রী মথ পাতার মধ্যশিরার কাছে একটা একটা করে ডিম পাড়ে এবং ৫-৭ দিনের মধ্যে ডিম থেকে কিড়া বের -হয়। কীড়াগুলো মোড়ানো পাতার মধ্যেই জীবন কাটায়। তিন থেকে চার সপ্তাহে কীড়া পুত্তলিতে পরিণত হয়। পুত্তলির জীবনকাল এক সপ্তাহ এবং পূর্ণবয়স্ক মথ দিন বেঁচে থাকতে পারে।<br/>" +
            "<b>ক্ষতি:</b><br/>" +
            "১। পাতামোড়ানো পোকার কীড়া পাতা লম্বালম্বি মুড়িয়ে পাতার সবুজ অংশ খায়<br/>" +
            "২। খুব বেশি ক্ষতি করলে পাতা পুড়ে যাওয়ার মতো দেখায়।<br/>" +
            "<b>দমন ব্যবস্থা:</b><br/>" +
            "<b>গলমাছি :</b><br/>" +
            "১। আলোক ফাঁদের সাহায্যে পূর্ণবয়স্ক পোকা মেরে ফেলা<br/>" +
            "২। প্রয়োজনে কীটনাশক ব্যবহার করা। (তবে এক্ষেত্রে শতকরা ৫ ভাগ পেঁয়াজপাতা বা গল পাওয়া গেলেই শুধু কীটনাশক প্রয়োগের চিন্তা করা উচিত)<br/>" +
            "<b>থ্রিপস :</b><br/>" +
            "১। আক্রান্ত জমিতে নাইট্রোজেন সার (ইউরিয়া) ব্যবহার করা। শুধু প্রয়োজনে অনুমোদিত কীটনাশক ব্যবহার করা।<br/>" +
            "<b>পামরি পোকা :</b><br/>" +
            "১। প্রতিরোধশীল জাত, যেমন বিআর ১৪ (বোরো), বিআর২৫, ব্রি ধান (আমন) এর চাষ করা।<br/>" +
            "২। হাতজালের সাহয্যে পূর্ণবয়স্ক পোকা ধরে মেরে ফেলা।<br/>" +
            "৩। আক্রকান্ত পাতার গোড়া থেকে তিন সেন্টিমিটার উপরে পাতা কেটে নষ্ট করে ফেলা। তবে কাইচথোড় আসার পর পাতা কাটলে ফলনের ক্ষতি হবে<br/>" +
            "৪। প্রয়োজনে কীটনাশক ব্যবহার করা। (এক্ষেত্রে শতকরা ৩৫ ভাগ পাতা ক্ষতি গ্রস্ত হলে অথবা প্রতি গোছা ধানগাছে ৪টি পূর্ণবয়স্ক পোকা থাকলেই কীটনাশক প্রয়োগের চিন্তা করা উচিত)।<br/>" +
            "<b>ঘাসফড়িং:</b><br/>" +
            "১। হাত জাল দিয়ে পোকা ধরে মেরে ফেলা <br/>" +
            "২। ডালপালা পুঁতে পোকা খেকো পাখি বসার ব্যবস্থা করা।<br/>" +
            "৩। প্রয়োজনে কীটনাশক ব্যবহার করা। (এক্ষেত্রে শতকরা ২৫ ভাগ পাতা ক্ষতি গ্রস্ত হলেই কীটনাশক প্রয়োগের চিন্তা করা উচিত)।<br/>" +
            "<b>পাতামোড়ানো পোকা:</b><br/>" +
            "১। আলোক ফাঁদের সাহায্যে পোকা ধরে মেরে ফেলা<br/>" +
            "২। ক্ষেতে ডালপালা পুঁতে পোকা খেকো পাখি বসার ব্যবস্থা করা।<br/>" +
            "৩। প্রয়োজনে কীটনাশক ব্যবহার করা। (এক্ষেত্রে শতকরা ২৫ ভাগ পাতা ক্ষতি গ্রস্ত হলেই কীটনাশক প্রয়োগের চিন্তা করা উচিত)।<br/>" +
            "<center><h3>সার ব্যবস্থাপনা</h3></center>" +
            " <table border = \"1\">" +
            "         <tr>" +
            "            <td>সারের নাম</td>" +
            "            <td>পরিমাণ (কেজি/বিঘা)</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>ইউরিয়া</td>" +
            "            <td>১৭</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>টিএসপি</td>" +
            "            <td>১৩</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>এমপি</td>" +
            "            <td>১১</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>জিপসাম</td>" +
            "            <td>১৩</td>" +
            "         </tr>" +
            "         <tr>" +
            "            <td>জিংকসালফেট</td>" +
            "            <td>১</td>" +
            "         </tr>" +
            "      </table>" +
            "<br/>" +
            "সর্বশেষ জমি চাষের সময় সবটুকু টিএসটি, এমওপি, জিপসাম এবং জিংক সালফেট একসাথে প্রয়োগ করা উচিত। ইউরিয়া সার সমান ৩ ভাগে ভাগ করে যথা ১৫ দিনি পর ১ম কিস্তি ২৫ দিন পর ২য় কিস্তি এবং ৩৫ দিন পর ৩য় কিস্তি প্রয়োগ করতে হবে।<br/>" +
            "<b>বীজের পরিমাণ (বীজ ছিটিয়ে) :</b> ৯-১০ কেজি/বিঘা" +
            "<br/>" +
            "আগাছা দমন : বপনের অন্তত ৩০-৪০ দিন পর পর্যন্ত জমি আগাছামুক্ত রাখতে হবে। মনে রাখতে হবে, সময়মত আগাছা দমন না করলে বোনা আউশ ধানের ফলন ৮০-১০০ ভাগও কমে যেতে পারে।" +
            "<br/>" +
            "সূত্র: বাংলাদেশ রাইস নলেজ ব্যাংক" +
            "</big></body></html>";
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_bri65);
        textView = (TextView) findViewById(R.id.textViewId);
        webView = (WebView) findViewById(R.id.webViewId);
        webView.loadDataWithBaseURL(null,myText,"text/html","utf-8",null);
        textView.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Bri65Activity.this,Button5Activity.class);
                startActivity(intent);
            }
        });
    }
}
