package com.helpagri.agrimaster;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.webkit.WebView;
import android.widget.TextView;

public class PossibilityActivity extends AppCompatActivity {


    private TextView textView;
    private WebView webView;
    String myText="<html><body><center><h1>প্রযুক্তির বিবরণ</h1></center>" +
            "<big>প্রযুক্তির নাম :<b>হাইড্রোপনিক পদ্ধতিতে ক্যাপসিকামের চাষ</b><br/><br/>" +
            "<b>বিস্তারিত বিবরণ :</b><br/>" +
            "<b>হাইড্রোপনিক পদ্ধতিতে ক্যাপসিকামের চাষ :</b>" +
            "হাইড্রোপনিকস (Hydroponics) পদ্ধতি হলো নিয়ন্ত্রিত অবস্থায় মাটির পরিবর্তে পানিতে গাছের প্রয়োজনীয় খাবার (Nutrient) সরবরাহ করে লাভজনকভাবে ও অর্থকরী ফসল উৎপাদনের কৌশল । জনবহুল দেশে যেখানে স্বাভাবিক চাষের জমি কম কিংবা নাই এমন দেশের ঘরের ছাদ, আঙ্গিনা, নেট বা গ্লাসহাউজ ইত্যাদিতে Hydroponics পদ্ধতিতে সব্জি উৎপাদন করা হয়। উন্নত বিশ্বের যেমনঃ ইউরোপ, আমেরিকা, জাপান, তাইওয়ান, চীন, থাইল্যান্ড, সিঙ্গাপুর, মালেশিয়া এবং মধ্য-প্রাচ্যের দেশসমুহে বানিজ্যিকভাবে Hydroponic Culture এর মাধ্যমে সব্জি উৎপাদন করা হচ্ছে। এই পদ্ধতিতে সারা বছরই সবজি উৎপাদন করা সম্ভব এবং উৎপাদিত সব্জিতে কোন কীটনাশক ব্যবহার করা হয় না বিধায় এ সব্জি নিরপদ এবং অধিক বাজার মূল্য পাওয়া যায়। Hydroponics পদ্ধতিতে মাটিবিহীন বড় ষ্টীলের বা প্লাষ্টিকের ট্রেতে পানির মধ্যে গাছের অত্যাবশ্যকীয় খাদ্যোপাদান সমূহ সরবরাহ করে সাফল্যজনকভাবে ক্যাপসিকাম, লেটুস, টমেটো, শসা, ক্ষীরা এবং ষ্ট্রবেরী উৎপাদন করা সম্ভব হয়েছে।<br>" +
            "<b>হাইড্রোপনিকস পদ্ধতির চারা উৎপাদন :</b>" +
            "হাইড্রোপনিকস পদ্ধতিতে চারা উৎপাদনের জন্য স্পঞ্জ (Sponge) ব্লক ব্যবহার করা হয়। সাধারনত স্পঞ্জকে ৩০ সেঃ মিঃ × ৩০ সেঃ মিঃ সাইজে কেটে নিতে হয়। এই স্পঞ্জকে ২.৫ সেঃ মিঃ দৈর্ঘ্য এবং ২.৫ সেঃ মিঃ প্রস্থ বর্গাকারে, ডট ডট করে কেটে নিতে হয় এবং এর মাঝে ১ সেঃ মিঃ করে কেটে প্রতিটি বর্গাকারে স্পঞ্জ এর মধ্যে ১ টি করে বীজ বপন করতে হয়। বীজ বপনের পূর্বে বীজকে ১০% ক্যালসিয়াম অথবা সোডিয়াম হাইপোক্লোরাইড দিয়ে বীজ শোধন করে নিতে হবে। বীজ বপনের পর স্পঞ্জকে ১টি ছোট ট্রেতে রাখতে হবে। এই ট্রের মধ্যে ৫-৮ সেঃ মিঃ পানি রাখতে হবে যাতে স্পঞ্জ টি পানিতে সহজে ভাসতে পারে। চারা গজানোর ২-৩ দিন পর প্রাথমিক অবস্থায় ৫-১০ মিঃ লিঃ খাদ্যপাদানে সমবলিত দ্রবন ১ বার এবং চারা গজানোর ১০-১২ দিন পর থেকে চারা রোপনের পূর্ব পর্যন্ত প্রতিদিন ১০-২০ মিঃ লিঃ দ্রবন দিতে হবে।<br>" +
            "<b>হাইড্রোপনিক্সে ক্যাপসিকাম চাষ পদ্ধতি :</b>" +
            "চারার বয়স যখন ৪-৫ সপ্তাহ তখন ক্যাপসিকামের চারা রোপন করার উপযুক্ত সময়। চারা রোপনের পর দ্রবনের pH মাত্রা ৫.৮-৬.৫ এর মধ্যে এবং EC মাত্রা ১.৫-১.৯ এর মধ্যে রাখা দরকার । গাছে ফুল আসা শুরু হলে EC মাত্রা বাড়িয়ে ২.০-২.৫ এর মধ্যে রাখতে হবে। ক্যাপসিকাম উৎপাদনে মাঝে মাঝে Fe এর অভাবে উপরের দিকের পাতা হলুদ হয়ে যেতে পারে। গাছে এরূপ অবস্থা দেখা দিলে ১০ গ্রাম EDTA আয়রন ১ লিটার পানিতে দ্রবীভূত করে ১০০০ লিটার দ্রবনের সাথে মিশিয়ে দিতে হবে। ক্যাপসিকাম গাছকে সোজা রাখার জন্য X আকারের বাঁশের কিংবা কাঠের তৈরী খুঁটি দিয়ে ঠেস (Support) দিতে হবে। মাঝে মাঝে গাছের নিচের দিকের বয়স্ক পাতাগুলি কেটে পরিস্কার করে দিতে হবে। সাধারনতঃ চারা লাগানোর ২৫-৩০ দিনের মধ্যে ফুল এবং ৬০-৬৫ দিনের মধ্যে ক্যাপসিকাম উত্তোলন করা সম্ভব। প্রতিটি গাছ থেকে ৮-৯টি ফল উত্তোলন করা সম্ভব। জাত ভেদে প্রতিটি ফলের গড় ওজন প্রায় ১৫০-২০০ গ্রাম পর্যন্ত হতে পারে।<br>" +
            "<center><img src=\"file:///android_res/drawable/capsicum.gif\" width=\"150\" height=\"100\" /></center><br>" +
            "<center>হাইড্রোপনিক পদ্ধতিতে ক্যাপসিকামের চাষ</center>"+
            "</big></body></html>";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_possibility);

        textView=(TextView) findViewById(R.id.textViewId);
        webView=(WebView) findViewById(R.id.webViewId);

        webView.loadDataWithBaseURL(null, myText, "text/html", "utf-8", null);

        textView.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(PossibilityActivity.this,Button5Activity.class);
                startActivity(intent);
            }
        });
    }
}
